## Plan Result (prod-prod)




<pre><code>Plan: 82 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlf5cc&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlf5demo&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlf5dev&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlf5perim&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlf5stage&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlf5test&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlsftp01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betanlsftp02&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betapreprodbackup01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betapreprodf5cc&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betapreprodf5internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betapreprodf5perim&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betapreprodsftp01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betaprodbackup01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betaprodf5cc&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betaprodf5internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betaprodf5perim&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betaprodfailover01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;betaprodsftp01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;demof5lb&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;devf5lb&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;preprodf5lb&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;prodf5lb&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevbastion02&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsadmin01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbackup01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbackup03&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbastion&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsbuildagent01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsdns01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsdns02&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsjenkins01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtdevopsldap01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtf5internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtf5perim&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtmta&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtproxyin&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;reformmgmtproxyout&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;refromsscssftpvm01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;servicenowmid01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;sftp&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;sftp-dev&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;sftp-prod&#34;]
  * module.lncs-hmcs.azurerm_private_dns_a_record.this[&#34;testf5lb&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;backup1&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;backup2&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;bastion&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;dashboard&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;demoproxyin&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;ldap&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;mgmtf5int&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;mgmtf5perim&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;mta&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;password&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;passwordchange&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;prod-build&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;prodproxyin&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;proxyin&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;proxyout&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;reformmgmtadmin01&#34;]
  * module.lncs-hmcs.azurerm_private_dns_cname_record.this[&#34;reformmgmtdevbastion&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone.zone[0]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-aat-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-demo-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat2-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-demo-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-preview-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-prod2&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-sandbox-idam-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-preview-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-prod-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-sandbox-idam-internal&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-platform&#34;]
  * module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlf5cc"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlf5cc"
      + records             = [
          + "10.15.15.244",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlf5demo"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlf5demo"
      + records             = [
          + "10.15.15.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlf5dev"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlf5dev"
      + records             = [
          + "10.15.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlf5perim"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlf5perim"
      + records             = [
          + "10.15.15.254",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlf5stage"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlf5stage"
      + records             = [
          + "10.15.15.248",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlf5test"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlf5test"
      + records             = [
          + "10.15.15.246",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlsftp01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlsftp01"
      + records             = [
          + "10.15.11.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betanlsftp02"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betanlsftp02"
      + records             = [
          + "10.15.11.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betapreprodbackup01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betapreprodbackup01"
      + records             = [
          + "10.32.4.8",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betapreprodf5cc"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betapreprodf5cc"
      + records             = [
          + "10.47.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betapreprodf5internal"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betapreprodf5internal"
      + records             = [
          + "10.47.15.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betapreprodf5perim"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betapreprodf5perim"
      + records             = [
          + "10.45.0.254",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betapreprodsftp01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betapreprodsftp01"
      + records             = [
          + "10.47.11.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betaprodbackup01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betaprodbackup01"
      + records             = [
          + "10.16.4.13",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betaprodf5cc"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betaprodf5cc"
      + records             = [
          + "10.31.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betaprodf5internal"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betaprodf5internal"
      + records             = [
          + "10.31.15.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betaprodf5perim"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betaprodf5perim"
      + records             = [
          + "10.29.0.254",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betaprodfailover01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betaprodfailover01"
      + records             = [
          + "10.16.0.200",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["betaprodsftp01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "betaprodsftp01"
      + records             = [
          + "10.31.11.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["demof5lb"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "demof5lb"
      + records             = [
          + "10.15.15.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["devf5lb"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "devf5lb"
      + records             = [
          + "10.1.255.254",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["preprodf5lb"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "preprodf5lb"
      + records             = [
          + "10.47.15.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["prodf5lb"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prodf5lb"
      + records             = [
          + "10.31.15.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevbastion02"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevbastion02"
      + records             = [
          + "172.16.0.4",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsadmin01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsadmin01"
      + records             = [
          + "172.16.2.17",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsbackup01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsbackup01"
      + records             = [
          + "172.16.2.15",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsbackup03"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsbackup03"
      + records             = [
          + "172.16.2.39",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsbastion"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsbastion"
      + records             = [
          + "172.16.0.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsbuildagent01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsbuildagent01"
      + records             = [
          + "172.16.4.17",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsdns01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsdns01"
      + records             = [
          + "172.16.0.10",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsdns02"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsdns02"
      + records             = [
          + "172.16.0.14",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsjenkins01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsjenkins01"
      + records             = [
          + "172.16.2.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtdevopsldap01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevopsldap01"
      + records             = [
          + "172.16.2.8",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtf5internal"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtf5internal"
      + records             = [
          + "172.31.254.252",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtf5perim"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtf5perim"
      + records             = [
          + "172.31.254.254",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtmta"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtmta"
      + records             = [
          + "172.16.0.8",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtproxyin"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtproxyin"
      + records             = [
          + "172.16.0.6",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["reformmgmtproxyout"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtproxyout"
      + records             = [
          + "172.16.0.7",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["refromsscssftpvm01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "refromsscssftpvm01"
      + records             = [
          + "10.32.0.16",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["servicenowmid01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "servicenowmid01"
      + records             = [
          + "172.16.0.16",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["sftp"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sftp"
      + records             = [
          + "51.132.40.106",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["sftp-dev"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sftp-dev"
      + records             = [
          + "51.140.117.157",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["sftp-prod"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sftp-prod"
      + records             = [
          + "51.140.47.203",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 60
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_a_record.this["testf5lb"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "testf5lb"
      + records             = [
          + "10.1.255.254",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["backup1"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "backup1"
      + record              = "reformmgmtbackup01.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["backup2"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "backup2"
      + record              = "reformmgmtdevopsbackup01.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["bastion"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bastion"
      + record              = "reformmgmtdevbastion02.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["dashboard"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dashboard"
      + record              = "proxyin.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["demoproxyin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "demoproxyin"
      + record              = "betademoaproxyin01.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["ldap"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ldap"
      + record              = "reformmgmtdevopsldap01.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["mgmtf5int"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mgmtf5int"
      + record              = "reformmgmtf5internal.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["mgmtf5perim"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mgmtf5perim"
      + record              = "reformmgmtf5perim.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["mta"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mta"
      + record              = "reformmgmtmta.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 3600
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["password"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "password"
      + record              = "proxyin.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["passwordchange"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "passwordchange"
      + record              = "proxyin.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["prod-build"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prod-build"
      + record              = "proxyin.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 3600
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["prodproxyin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prodproxyin"
      + record              = "reformmgmtproxyin02.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["proxyin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "proxyin"
      + record              = "reformmgmtproxyin.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["proxyout"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "proxyout"
      + record              = "reformmgmtproxyout.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["reformmgmtadmin01"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtadmin01"
      + record              = "reformmgmtdevopsadmin01.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_cname_record.this["reformmgmtdevbastion"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformmgmtdevbastion"
      + record              = "reformmgmtdevbastion02.reform.hmcts.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "reform.hmcts.net"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "reform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-aat-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-demo-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-demo-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-demo/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-demo"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat2-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat2-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-demo-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-demo-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-demo/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-demo"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-preview-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-preview"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-prod"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-prod2"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-prod2"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-sandbox-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-sandbox-idam-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-idam-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-sandbox"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-preview-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-prod-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-prod-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-sandbox-idam-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-sandbox-idam-internal"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/core-infra-sandbox/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-sandbox"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-platform"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-platform"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.lncs-hmcs.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "vpn"
      + private_dns_zone_name = "reform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
    }

Plan: 82 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":588,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->